const ONE_LINES = [
  ["ꉌꑍꆀꀋꃅ", "鼠日不送灵"],
  ["ꑛꑍꎆꀋꎹ", "牛日不找钱"],
  ["ꆿꑍꇖꀋꊪ", "虎日不播种"],
  ["ꄯꆪꑍꋚꀋꎴ", "兔日不收割"],
  ["ꇐꑍꍯꀋꊪ", "龙日不插秧"],
  ["ꏂꑍꌋꀋꑐ", "蛇日不修指甲"],
  ["ꃅꑍꑳꀋꋉ", "马日不建房"],
  ["ꑿꑍꆅꀋꉃ", "羊日不祛病"],
  ["ꑙꑍꃢꀋꈪ", "猴日不缝衣"],
  ["ꃬꑍꀑꀋꋍ", "鸡日不剃头"],
  ["ꈌꑍꑮꀋꑟ", "狗日不嫁娶"],
  ["ꃮꑍꈜꀋꎼ", "猪日不远行"],
];
const ONE_LINE_LIST = [
  "今日出行，东易进财；西易进财；北易病痛；南易失财。",
  "今日出行，东易进财；西易病痛；北忌不宜谋财；往南易失财。",
  "今日出行，东易进财；西易遇凶灾；北不宜谋财；南有财运。",
  "今日出行，东易进财；西凶灾失财；北易诈取财；南有财运。",
  "今日出行，东易进财；西不吉利；北易失财；南易遇凶灾。",
  "今日出行，东易进财；西易迷路；北易遇到冲突；南易进财。",
  "今日出行，东易落魄；西易遇凶灾；北易病痛；南易进财。",
  "今日出行，东易进财；西易落魄；北易遇凶灾；南易受伤。",
  "今日出行，东得酒肉；西易遇凶灾；北易进财；南易落魄。",
  "今日出行，东易遇灾难；西易进财；北不吉利；南易遇凶灾。",
  "今日出行，东易遇凶灾；西易进财；北不吉利；南易遇凶灾。",
  "今日出行，东易进财；西易得不义之财；北得酒肉；南易生病。",
];
export function getTodayFortune(index: number) {
  return {
    taboo: ONE_LINES[index],
    tabooFull: ONE_LINE_LIST[index],
  };
}
