// 彝族生肖以及对应的中文名称
export const ZODIAC = ["ꉌ", "ꑛ", "ꆿ", "ꄯꆪ", "ꇐ", "ꏂ", "ꃅ", "ꑿ", "ꑙ", "ꃬ", "ꈌ", "ꃮ"]
export const ZODIAC_CN=["鼠", "牛", "虎", "兔", "龙", "蛇", "马", "羊", "猴", "鸡", "狗", "猪"]
// 彝族生肖的中文名称映射表
export const ZODIAC_TO_YI = new Map(ZODIAC_CN.map((item, index) => [item, ZODIAC[index]]))
export const ZODIAC_TO_CN = new Map(ZODIAC_CN.map((item, index) => [ZODIAC[index],item]))
//月明月暗
export const MONTH_DARK = ["ꅂ1", "ꅂ2", "ꅂ3", "ꅂ4", "ꅂ5", "ꅂ6", "ꅂ7", "ꅂ8", "ꅂ9", "ꅂ10", "ꅂ11", "ꅂ12", "ꅂ13", "ꅂ14", "ꅂ15", "ꒉ1", "ꒉ2", "ꒉ3", "ꒉ4", "ꒉ5", "ꒉ6", "ꒉ7", "ꒉ8", "ꒉ9", "ꒉ10", "ꒉ11", "ꒉ12", "ꒉ13", "ꒉ14", "ꒉ15"]
export const MONTH_DARK_CN = ["明一", "明二", "明三", "明四", "明五", "明六", "明七", "明八", "明九", "明十", "明十一", "明十二", "明十三", "明十四", "明十五", "暗一", "暗二", "暗三", "暗四", "暗五", "暗六", "暗七", "暗八", "暗九", "暗十", "暗十一", "暗十二", "暗十三", "暗十四", "暗十五"]
//八个方位
export const DIRECTION =  ["ꒈꂪ", "ꑾꌋꈤ", "ꁮꐚ", "ꈌꄸꉻ", "ꒈꀑ", "ꑛꌋꈤ", "ꁭꅐ", "ꇐꄸꉻ"]
export const DIRECTION_CN = ["日木(南)", "约色果(西南)", "布吉(西)", "克底伙(西北)", "日伍(北)", "扭色果(东北)", "布都(东)", "尔底伙(东南)"]